![](NotebookHeader.jpg)

# Course                  : Python for Data Science

## Module 3 Lesson 4  : Hands On Exercise/Assignment :  DataFrame using Datafile (CSV)

####  In this practice exercise you need to work on the examples applying the various DataFrame concepts learned. This practice will familiarize you with working on DataFrame using a data from a file.

In [1]:
import pandas  as pd
import numpy as np

###  > Q1 : Create a dataframe  using the Input Data File.

In [2]:
import os
os.getcwd() # Print Current working directory to be sure of path

'C:\\Python\\DSACourse\\CoursePythonNotebooks'

In [6]:
df = pd.read_csv("data/StatePerformance.csv", header=None)
c

,0,1,2,3,4,5,6,7
0,female,Baltimore,bachelor's degree,standard,none,72,72,74
1,female,Connecticut,some college,standard,completed,69,90,88
2,female,Baltimore,master's degree,standard,none,90,95,93
3,male,Arizona,associate's degree,free/reduced,none,47,57,44
4,male,Connecticut,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,Florida,master's degree,standard,completed,88,99,95
996,male,Connecticut,high school,free/reduced,none,62,55,55
997,female,Connecticut,high school,free/reduced,completed,59,71,65
998,female,Delaware,some college,standard,completed,68,78,77
999,female,Delaware,some college,free/reduced,none,77,86,86

###  > Q2 :  Assign the column names using Columns from the Metadata File.

In [12]:
df_header = pd.read_csv("data/StatePerformance_metadata.csv")
df_header
df.columns = df_header.columns
df.columns

Index(['gender', 'state', 'education level', 'lunch', 'test', 'math score',
       'science score', 'english score'],
      dtype='object')

###  > Q3 :  Assign proper Datatype to the columns.

In [22]:
df.dtypes           # Review the column data types as part of the dataframe creation

gender              object
state               object
education level     object
lunch               object
test                object
math score         float64
science score      float64
english score      float64
dtype: object

In [20]:
df['math score'] = df['math score'].astype(float)
df['science score'] = df['science score'].astype(float)
df['english score'] = df['english score'].astype(float)
df.dtypes

gender              object
state               object
education level     object
lunch               object
test                object
math score         float64
science score      float64
english score      float64
dtype: object

###  > Q4 Retrieve first five columns.

In [24]:
df.iloc[:,0:4]

     gender        state     education level         lunch
0    female    Baltimore   bachelor's degree      standard
1    female  Connecticut        some college      standard
2    female    Baltimore     master's degree      standard
3      male      Arizona  associate's degree  free/reduced
4      male  Connecticut        some college      standard
..      ...          ...                 ...           ...
995  female      Florida     master's degree      standard
996    male  Connecticut         high school  free/reduced
997  female  Connecticut         high school  free/reduced
998  female     Delaware        some college      standard
999  female     Delaware        some college  free/reduced

[1000 rows x 4 columns]

###  > Q5   Perform following Calculations :

- Calculate Average (or Mean) Math Score.
- Calculate Average (or Mean) Math Score by States.
- Calculate Minimum Science Score and print name of the corresponding state

In [26]:
df['math score'].mean()

66.089

In [47]:
# df['math score'].groupby('state').mean()
df_grouped = df.groupby('state').mean()
df_grouped['math score']

state
Arizona        61.629213
Baltimore      63.452632
Connecticut    64.463950
Delaware       67.362595
Florida        73.821429
Name: math score, dtype: float64

In [44]:
minscore = df['science score'].min()
cond = df['science score'] == minscore
df[cond]
df.loc[cond,['state','science score']]

          state  science score
59  Connecticut           17.0

###  > Q6 Retrieve the following datasets / values::

- List of states where the science score is greater than average or mean.

In [72]:
avgscore = df['science score'].mean()
avgscore

             math score  science score  english score
state
Arizona       61.629213      64.674157      62.674157
Baltimore     63.452632      67.352632      65.600000
Connecticut   64.463950      69.103448      67.827586
Delaware      67.362595      70.030534      70.145038
Florida       73.821429      73.028571      71.407143

In [56]:
cond = df_grouped['science score'] > avgscore
df_grouped[cond]['']

state
Delaware    70.030534
Florida     73.028571
Name: science score, dtype: float64

####  > Print names of top three best performing states -Performance defined as best scores across subjects

In [76]:
df_grouped
df_sorted = df_grouped.sort_values("science score", ascending = False)
df_sorted                # One method is to look at sorted values.

             math score  science score  english score
state
Florida       73.821429      73.028571      71.407143
Delaware      67.362595      70.030534      70.145038
Connecticut   64.463950      69.103448      67.827586
Baltimore     63.452632      67.352632      65.600000
Arizona       61.629213      64.674157      62.674157

In [80]:
# Method 2 : Can create a total's column and use
df_sorted['Total'] = df_sorted['math score'] +  df_sorted['science score'] + df_sorted['english score']
df_sorted['Total']

state
Florida        218.257143
Delaware       207.538168
Connecticut    201.394984
Baltimore      196.405263
Arizona        188.977528
Name: Total, dtype: float64